# BuiltInFailures.KeyBasedTreeFileFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeFileFailures Properties
BuiltInFailures..::..KeyBasedTreeFileFailures Class See Also
---
The BuiltInFailures..::..KeyBasedTreeFileFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotOpenFileForRead | Cannot open file [FileName]. |
| CannotUnderstandAtLine | Cannot understand [EntryType] line '[Number]' |

# See Also
BuiltInFailures..::..KeyBasedTreeFileFailures Class
Autodesk.Revit.DB Namespace